In [34]:
import pandas as pd

data = pd.DataFrame({'Country':['US','US','INDIA','INDIA'],
                      'City':['WASHINGTON','SEATTLE','DELHI','BANGALORE'],
                      'Name':['DONALD','MIKHAIL','MOHAN','HARRY']})

In [35]:
data

         City Country     Name
0  WASHINGTON      US   DONALD
1     SEATTLE      US  MIKHAIL
2       DELHI   INDIA    MOHAN
3   BANGALORE   INDIA    HARRY

In [36]:
data[data['Country']=='US'].replace({'Name':{'MIKHAIL':'MICHAEL'}},inplace=True)
data[data['Country']=='INDIA'].replace({'Name':{'HARRY':'HARI'}},inplace=True)

/Users/sashirajc/anaconda/lib/python2.7/site-packages/pandas/core/generic.py:3378: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  inplace=False, regex=regex)

In [37]:
df=data.loc[data['Country']=='US']
df.replace({'Name':{'MIKHAIL':'MICHAEL'}},inplace=True)

In [38]:
data

         City Country     Name
0  WASHINGTON      US   DONALD
1     SEATTLE      US  MIKHAIL
2       DELHI   INDIA    MOHAN
3   BANGALORE   INDIA    HARRY